cask_args appdir: '/Applications'

# Needed for other dependencies
brew 'coreutils'
brew 'gpg'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libtool'
brew 'unixodbc'
brew 'qt'

tap 'hashicorp/tap'
tap 'jandedobbeleer/oh-my-posh'
tap 'oven-sh/bun'

brew 'awscli'
# `cat` alternative
brew 'bat'
brew 'bottom'
brew 'bun'
brew 'cloc'
brew 'ctags'
# `find` alternative
brew 'fd'
# `jq` alternative
brew 'fx'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gnu-sed'
brew 'oh-my-posh'
brew 'jq'
brew 'mise'
brew 'neovim'
brew 'fsouza/prettierd/prettierd'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'hashicorp/tap/terraform'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zoxide'
brew 'zsh'

cask '1password'
cask 'alacritty'
cask 'alfred'
cask 'aws-vault'
cask 'bettertouchtool'
cask 'discord'
cask 'firefox'
cask 'ghostty'
cask 'google-chrome'
cask 'kap'
cask 'ngrok'
cask 'obsidian'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
