cask_args appdir: '/Applications'

# Needed for other dependencies
brew 'coreutils'
brew 'gpg'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libtool'
brew 'unixodbc'
brew 'qt'

tap 'hashicorp/tap'

brew 'fzf'
brew 'vim'
brew 'git'
brew 'gh'
brew 'z'
brew 'neovim'
brew 'tmux'
brew 'hashicorp/tap/terraform'
brew 'reattach-to-user-namespace'
brew 'htop'
brew 'fsouza/prettierd/prettierd'
brew 'jq'
brew 'ctags'
brew 'tldr'
brew 'tree'
brew 'ripgrep'
brew 'zsh'

cask 'aws-vault'
cask 'alacritty'
cask '1password'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'alfred'
cask 'bettertouchtool'
cask 'ngrok'
cask 'spotify'
cask 'discord'
cask 'visual-studio-code'
